vinhlephu-lpv/robot-ws/src/esp32_source/code0409.ino
#include <Arduino.h>
#include <WiFi.h>

// ============================================================
//  1. CẤU HÌNH THÔNG SỐ CƠ KHÍ & QUADRATURE ENCODER X4
// ============================================================
#define ENCODER_PPR             200       // Xung/vòng gốc mỗi kênh
#define QUADRATURE_FACTOR       4         // X4: 800 count/vòng bánh (độ phân giải cao nhất)
#define ENCODER_CPR             (ENCODER_PPR * QUADRATURE_FACTOR) // 800 count/rev
#define WHEEL_DIAMETER_M        0.20f     // Đường kính bánh xe: 200mm (0.2m)
#define WHEEL_CIRCUMFERENCE     (PI * WHEEL_DIAMETER_M)  // Chu vi bánh ≈ 0.6283m

// Chu kỳ tính toán thời gian thực
#define SPEED_CALC_INTERVAL_MS  50        // Tính tốc độ & gửi ODOM/RAW mỗi 50ms (20 Hz)
#define RAMP_INTERVAL_MS        25        // Khởi động mềm Slew Rate mỗi 25ms (40 Hz)
#define ROS_WATCHDOG_TIMEOUT_MS 1500      // Watchdog an toàn: Dừng xe nếu mất lệnh ROS 2 quá 1.5s

// Giới hạn gia tốc & Vùng an toàn PWM
#define MIN_PWM                 0         // Cho phép toàn dải 0-255 PWM cho tốc độ cực chậm
#define MAX_PWM_CHANGE_UP       35        // Bước tăng PWM tối đa mỗi chu kỳ (tăng lực êm, không giật sốc)
#define MAX_PWM_CHANGE_DOWN     25        // Bước giảm PWM tối đa (bảo vệ cơ cấu nhông hộp số)
#define RAMP_STEP_MAX           12.0f     // Bước ramp gia tốc tối đa
#define RAMP_STEP_MIN           2.5f      // Bước ramp khởi động dứt khoát
#define RAMP_STEP_STOP_MAX      5.0f      // Bước giảm tốc êm ái khi dừng

// Lọc nhiễu Encoder & Ngưỡng vật lý
#define MIN_ENC_INTERVAL_US     15        // Chặn gai nhiễu megahertz tia lửa chổi than (<15us)
#define MAX_PLAUSIBLE_RPM       350.0f    // Ngưỡng RPM tối đa vật lý (loại bỏ đột biến)
#define MOVING_AVG_SIZE         2         // Kích thước mảng trượt ngắn (loại bỏ trễ pha 150-200ms)
#define DERIVATIVE_FILTER       0.6f      // Hệ số lọc thông thấp cho khâu vi phân PID
#define EMA_LOW_SPEED_ALPHA     0.70f     // Phản hồi tốc độ tức thời (<40 RPM), không gây trễ vòng lặp PID
#define EMA_HIGH_SPEED_ALPHA    0.80f     // EMA tốc độ cao (phản hồi nhanh)
#define PID_ERROR_DEADBAND      0.5f      // Vùng chết sai số PID hợp lý

// Giám sát an toàn & Kẹt bánh (Stall Detection)
#define STALL_DETECT_MS         1200      // Cho phép 1.2s mô-men xoắn cực đại trước khi cảnh báo
#define STALL_PWM_THRESHOLD     180
#define STALL_RPM_THRESHOLD     4.0f

// Dự phòng phần cứng nếu có 1 encoder bị lỗi (false: đủ 4 encoder)
#define WHEEL3_ENCODER_FAULT    false

// ============================================================
//  2. CẤU HÌNH WIFI (KẾT NỐI LẤY IP & XEM IP QUA SERIAL)
// ============================================================
const char* ssid     = "CTU";
const char* password = "";

// ============================================================
//  3. SƠ ĐỒ CHÂN GPIO BTS7960 (4 MẠCH CẦU H ĐỘC LẬP)
// ============================================================
#define DRV1_RPWM   47   // Bánh 0: Trái trước (FL)
#define DRV1_LPWM   4
#define DRV2_RPWM   45   // Bánh 1: Trái sau (RL)
#define DRV2_LPWM   18
#define DRV3_RPWM   13   // Bánh 2: Phải trước (FR)
#define DRV3_LPWM   15
#define DRV4_RPWM   7    // Bánh 3: Phải sau (RR)
#define DRV4_LPWM   8

// Chiều quay chuẩn vi sai (+1: cùng chiều, -1: đảo chiều dây)
#define INV_DRV1     1   // Bánh trái trước (FL): Tiến
#define INV_DRV2     1   // Bánh trái sau   (RL): Tiến
#define INV_DRV3     1   // Bánh phải trước (FR): Đảo chiều động cơ vế phải
#define INV_DRV4     1   // Bánh phải sau   (RR): Đảo chiều động cơ vế phải (đồng bộ với FR)

const int PWM_FREQ = 7000;
const int PWM_RES  = 8;      // 8-bit: 0 - 255
const int CH_DRV1_F = 0, CH_DRV1_R = 1;
const int CH_DRV2_F = 2, CH_DRV2_R = 3;
const int CH_DRV3_F = 4, CH_DRV3_R = 5;
const int CH_DRV4_F = 6, CH_DRV4_R = 7;

// ============================================================
//  4. CẤU TRÚC DỮ LIỆU ENCODER, PID, KALMAN & SLEW RATE
// ============================================================
struct EncoderData {
  int   pinA, pinB;
  int   sign;                       // +1 bình thường, -1 đảo dấu đếm xung
  volatile long count;
  volatile uint8_t state;           // Trạng thái 2-bit (bit 1: Pha A, bit 0: Pha B)
  volatile unsigned long lastEdgeTime;
  long  lastSpeedCount;
  float rpm;
  float prevFilteredRpm;
  float speed_ms;
  float distance_m;
  float rpmBuffer[MOVING_AVG_SIZE];
  int   bufferIndex;
  float rawRpmHist[2];              // Bộ nhớ 2 chu kỳ cho Bộ lọc Trung vị 3 điểm (Median-3)
};

// Sơ đồ 4 Encoder: Trái trước (16,17), Trái sau (38,39), Phải trước (40,41), Phải sau (10,11)
EncoderData enc[4] = {
  {16, 17,  1, 0, 0, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f, {0}, 0, {0.0f, 0.0f}}, // enc[0]: FL (Trái trước)
  {38, 39,  1, 0, 0, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f, {0}, 0, {0.0f, 0.0f}}, // enc[1]: RL (Trái sau)
  {40, 41, -1, 0, 0, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f, {0}, 0, {0.0f, 0.0f}}, // enc[2]: FR (Phải trước)
  {10, 11, -1, 0, 0, 0, 0, 0.0f, 0.0f, 0.0f, 0.0f, {0}, 0, {0.0f, 0.0f}}  // enc[3]: RR (Phải sau)
};

struct WheelPID {
  float kp, ki, kd;
  float targetRPM;
  float integral;
  float lastError;
  float filteredDeriv;
  int   pwmOutput;
  int   prevPwmOutput;
  bool  enabled;
};

// Hệ số PID tối ưu êm ái cho 4 động cơ 775, không giật cục
#define PID_KP              0.750f  // Kp vừa phải để bám mượt, không dao động giật cục
#define PID_KI              0.500f  // Ki tích phân bù êm sai số ma sát hộp số
#define PID_KD              0.030f  // Kd nhỏ để hãm nhẹ
#define K_SYNC_CROSS_WHEEL  0.0f    // Khử hoàn toàn giằng co chéo bánh
#define K_LR_BALANCE        0.0f    // Để ROS tự chủ động điều phối góc quay Wz

WheelPID wpid[4] = {
  {PID_KP, PID_KI, PID_KD, 0.0f, 0.0f, 0.0f, 0.0f, 0, 0, true},
  {PID_KP, PID_KI, PID_KD, 0.0f, 0.0f, 0.0f, 0.0f, 0, 0, true},
  {PID_KP, PID_KI, PID_KD, 0.0f, 0.0f, 0.0f, 0.0f, 0, 0, true},
  {PID_KP, PID_KI, PID_KD, 0.0f, 0.0f, 0.0f, 0.0f, 0, 0, true}
};

// Bộ lọc Kalman 1D cho từng bánh xe (Tách nhiễu Gauss & triệt tiêu trễ pha)
struct Kalman1D {
  float x; // Ước lượng vận tốc RPM
  float p; // Sai số ước lượng
  float q; // Nhiễu quá trình mô hình
  float r; // Nhiễu đo lường encoder
  float k; // Hệ số tăng Kalman
};

Kalman1D kfRpm[4] = {
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f},
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f},
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f},
  {0.0f, 1.0f, 0.10f, 6.0f, 0.0f}
};

