vinhlephu-lpv/robot-ws/src/esp32_source/code0409.ino
inline float updateKalman1D(Kalman1D &kf, float measurement) {
  kf.p = kf.p + kf.q;
  kf.k = kf.p / (kf.p + kf.r);
  kf.x = kf.x + kf.k * (measurement - kf.x);
  kf.p = (1.0f - kf.k) * kf.p;
  return kf.x;
}

struct SlewChannel {
  int   target;                     // Tốc độ mục tiêu (-255 đến +255)
  float current;                    // Tốc độ hiện tại mượt mà
  float step;                       // Bước ramp động
};
SlewChannel slew[4] = {};

struct WheelHealth {
  bool isStalled;                   // Bị kẹt cứng cơ khí / hỏng encoder
  unsigned long stallStartTime;
};
WheelHealth wHealth[4] = {};

// Biến điều khiển & Giao tiếp
int           currentSpeed            = 200;
bool          isMoving                = false;
bool          pidGlobalEnabled        = true;
float         globalTargetRPM         = 60.0f;
String        currentDirection        = "STOP";
float         rosTargetRpmSigned[4]   = {0.0f, 0.0f, 0.0f, 0.0f};
unsigned long lastRosCmdTime          = 0;
String        serialRxBuf             = "";

unsigned long lastSpeedCalcTime       = 0;
unsigned long lastRampTime            = 0;

// Khai báo nguyên mẫu hàm
void stopMotor(bool emergency);
void stopMotor();
void setVehicleSpeed(int spd);
void updateWheelHealth();
void updatePID(float dt);
void handleCommand(String command);

// ============================================================
//  5. GIẢI MÃ QUADRATURE X4 TRONG IRAM (TÍNH TRỰC TIẾP QUA XOR)
// ============================================================
// Dùng công thức đại số XOR: step = (a ^ old_b) - (old_a ^ b)
// - Hoàn toàn trong thanh ghi CPU, không cần bảng lookup Flash/RAM
// - Triệt tiêu 100% lỗi linker: "dangerous relocation: l32r: literal placed after use"
// - Tốc độ ngắt cực nhanh (< 1 us)
#define HANDLE_ENCODER_ISR(idx) do { \
  unsigned long now = micros(); \
  if (now - enc[idx].lastEdgeTime >= MIN_ENC_INTERVAL_US) { \
    uint8_t a = (uint8_t)digitalRead(enc[idx].pinA); \
    uint8_t b = (uint8_t)digitalRead(enc[idx].pinB); \
    uint8_t old_a = (enc[idx].state >> 1) & 1; \
    uint8_t old_b = enc[idx].state & 1; \
    int8_t step = (int8_t)((old_a ^ b) - (a ^ old_b)); \
    if (step != 0) { \
      enc[idx].lastEdgeTime = now; \
      enc[idx].state = (a << 1) | b; \
      enc[idx].count += step * enc[idx].sign; \
    } \
  } \
} while(0)

void IRAM_ATTR isr_enc0() { HANDLE_ENCODER_ISR(0); }
void IRAM_ATTR isr_enc1() { HANDLE_ENCODER_ISR(1); }
void IRAM_ATTR isr_enc2() { HANDLE_ENCODER_ISR(2); }
void IRAM_ATTR isr_enc3() { HANDLE_ENCODER_ISR(3); }

// ============================================================
//  6. KHÓA CỨNG & XUẤT PWM MOTOR
// ============================================================
void lockAllDriverPins() {
  const int pins[] = {DRV1_RPWM, DRV1_LPWM, DRV2_RPWM, DRV2_LPWM, DRV3_RPWM, DRV3_LPWM, DRV4_RPWM, DRV4_LPWM};
  for (int p : pins) {
    pinMode(p, OUTPUT);
    digitalWrite(p, LOW);
  }
}

void pwmSetup(int pin, int channel) {
  pinMode(pin, OUTPUT);
  digitalWrite(pin, LOW);
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcAttach(pin, PWM_FREQ, PWM_RES);
  ledcWrite(pin, 0);
#else
  ledcSetup(channel, PWM_FREQ, PWM_RES);
  ledcAttachPin(pin, channel);
  ledcWrite(channel, 0);
#endif
}

void pwmWrite(int pin, int channel, int value) {
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcWrite(pin, value);
#else
  ledcWrite(channel, value);
#endif
}

void writeSingleDrive(int rpwmPin, int lpwmPin, int chF, int chR, int speed, int inv) {
  speed = speed * inv;
  if (speed > 0) {
    pwmWrite(rpwmPin, chF, speed);
    pwmWrite(lpwmPin, chR, 0);
  } else if (speed < 0) {
    pwmWrite(rpwmPin, chF, 0);
    pwmWrite(lpwmPin, chR, -speed);
  } else {
    pwmWrite(rpwmPin, chF, 0);
    pwmWrite(lpwmPin, chR, 0);
  }
}

void writeAllDrives(int s0, int s1, int s2, int s3) {
  writeSingleDrive(DRV1_RPWM, DRV1_LPWM, CH_DRV1_F, CH_DRV1_R, s0, INV_DRV1);
  writeSingleDrive(DRV2_RPWM, DRV2_LPWM, CH_DRV2_F, CH_DRV2_R, s1, INV_DRV2);
  writeSingleDrive(DRV3_RPWM, DRV3_LPWM, CH_DRV3_F, CH_DRV3_R, s2, INV_DRV3);
  writeSingleDrive(DRV4_RPWM, DRV4_LPWM, CH_DRV4_F, CH_DRV4_R, s3, INV_DRV4);
}

// ============================================================
//  7. TÍNH TOÁN VẬN TỐC & 5 TẦNG LỌC ENCODER
// ============================================================
inline float median3(float a, float b, float c) {
  if ((a <= b && b <= c) || (c <= b && b <= a)) return b;
  if ((b <= a && a <= c) || (c <= a && a <= b)) return a;
  return c;
}

float calculateMovingAverage(float buffer[], int size) {
  float sum = 0.0f;
  for (int i = 0; i < size; i++) sum += buffer[i];
  return sum / size;
}

void calculateSpeed() {
  unsigned long now = millis();
  if (now - lastSpeedCalcTime < SPEED_CALC_INTERVAL_MS) return;
  float dt = (now - lastSpeedCalcTime) / 1000.0f;
  lastSpeedCalcTime = now;
  unsigned long now_us = micros();

  for (int i = 0; i < 4; i++) {
    noInterrupts();
    long curCount = enc[i].count;
    interrupts();

    long pulses = curCount - enc[i].lastSpeedCount;
    enc[i].lastSpeedCount = curCount;

    // Tầng 1: Tấm khiên giới hạn vật lý (X4 CPR = 800 -> 350 RPM ≈ 233 xung/50ms)
    if (labs(pulses) > 240) {
      pulses = (pulses > 0) ? 240 : -240;
    }

    // Tầng 2: Chống trôi ảo khi dừng (Deadband Zero-Motion Suppression)
    if (!isMoving && wpid[i].targetRPM <= 0.1f && labs(pulses) <= 2) {
      pulses = 0;
    }

    // Tính RPM thô dựa trên CPR = 800
    float rawRPM = (pulses * 60.0f) / (ENCODER_CPR * dt);

    // Tầng 3: Bộ lọc trung vị 3 điểm (Median-3 Filter)
    float medRPM = median3(rawRPM, enc[i].rawRpmHist[0], enc[i].rawRpmHist[1]);
    enc[i].rawRpmHist[1] = enc[i].rawRpmHist[0];
    enc[i].rawRpmHist[0] = rawRPM;

    // Tầng 4: Bộ lọc quán tính chống đột biến (Physical Inertia Outlier Filter)
    if (fabsf(medRPM) > MAX_PLAUSIBLE_RPM || (isMoving && fabsf(medRPM - enc[i].prevFilteredRpm) > 50.0f)) {
      medRPM = enc[i].prevFilteredRpm;
    }

    enc[i].rpmBuffer[enc[i].bufferIndex] = medRPM;
    enc[i].bufferIndex = (enc[i].bufferIndex + 1) % MOVING_AVG_SIZE;

    // Tầng 5a: Bộ lọc trung bình trượt + EMA thích ứng tốc độ
    float movingAvgRPM = calculateMovingAverage(enc[i].rpmBuffer, MOVING_AVG_SIZE);
    float alpha = (fabsf(movingAvgRPM) < 40.0f) ? EMA_LOW_SPEED_ALPHA : EMA_HIGH_SPEED_ALPHA;
    float emaRpm = alpha * movingAvgRPM + (1.0f - alpha) * enc[i].prevFilteredRpm;
    enc[i].prevFilteredRpm = emaRpm;

    // Tầng 5b: BỘ LỌC KALMAN 1D TỐI ƯU (Khử trễ pha, cung cấp vận tốc chuẩn cho PID)
    enc[i].rpm = updateKalman1D(kfRpm[i], emaRpm);

    enc[i].speed_ms   = enc[i].rpm * WHEEL_CIRCUMFERENCE / 60.0f;
    enc[i].distance_m += (labs(pulses) * WHEEL_CIRCUMFERENCE) / ENCODER_CPR;
  }

#if WHEEL3_ENCODER_FAULT
  enc[3].rpm        = enc[2].rpm;
  enc[3].speed_ms   = enc[2].speed_ms;
  enc[3].distance_m = enc[2].distance_m;
  enc[3].count      = enc[2].count;
#endif

  // 1. GÓI RAW COUNT + TIMESTAMP (US) GỬI LÊN RASPBERRY PI 5 (ROS 2 JAZZY)
  // Định dạng chuẩn: RAW <sequence> <timestamp_us> <FL> <FR> <RL> <RR>
  // Thứ tự bánh: FL=enc[0], FR=enc[2], RL=enc[1], RR=enc[3]
  static uint32_t raw_seq = 0;
  raw_seq++;
  Serial.printf("RAW %lu %lu %ld %ld %ld %ld\n", raw_seq, now_us, enc[0].count, enc[2].count, enc[1].count, enc[3].count);

  // 2. Gói Odometry phản hồi (20 Hz)
  float v_left  = (enc[0].speed_ms + enc[1].speed_ms) / 2.0f;
  float v_right = (enc[2].speed_ms + enc[3].speed_ms) / 2.0f;

